# іконки
icon_error   = "❌️ |"
icon_alert   = "⚠️ |"
icon_success = "✅ |"
icon_crying  = "😭 |"

# мапи
gender_map1 = {
    0: "був",
    1: "була",
    2: "було",
    3: "були",
    4: "були"
}
gender_map2 = {
    0: "персонажа",
    1: "персонажки",
    2: "персонажа",
    3: "одного з персонажів",
    4: "одну з персонажок"
}
gender_map3 = {
    0: "персонажа",
    1: "персонажку",
    2: "персонажа",
    3: "одного з персонажів",
    4: "одну з персонажок"
}
gender_map4 = {
    0: "цього персонажа",
    1: "цю персонажку",
    2: "цього персонажа",
    3: "цих персонажів",
    4: "цих персонажок"
}
gender_map5 = {
    0: "відгаданий",
    1: "відгадана",
    2: "відгадано",
    3: "відгадані",
    4: "відгадані"
}
rarity_map1 = {
    0: "⚪ звичайна",
    1: "🎂 особлива",
    2: "🎄 зимова",
    3: "👘 східна",
    4: "🐰 великодня",
    5: "🧹 прислужна",
    6: "🏖️ літня",
    7: "🎒 шкільна",
    8: "🎃 гарбузова",
    9: "🐱 тваринна",
    10: "🌐 кросоверна",
    11: "♂️ чоловіча",
    12: "♀️ жіноча"
}

# повідомлення загальні
msg_error_not_chat_admin = icon_error + ", ти не адмін чату, цю команду можна використовувати лише їм!"

# повідомлення у __main__ message_counter
msg_alert_dont_spam      = icon_alert + ", не спами! Тепер я ігноруватиму твої повідомлення цілих 10 хвилин!"
msg_info_card_lost       = ("😭 Ех, ніхто не відгадав | на картці...\n\nЦе | <code>|</code>!\nТайтл: "
                            "<code>|</code>")

# повідомлення у __main__ send_image
msg_info_card_appear     = ("З'явилась | картка!\nВідгадуй | та збирай колекцію!"
                            "\n\nЩоб відгадувати:\n<code>/guess</code> <i>ім'я/прізвище |</i>")

# повідомлення у __main__ guess
msg_error_card_guessed   = icon_error + ", картку вже відгадали! "
msg_encouragement        = ["Але гарна спроба!",
                            "Наступного разу в тебе точно вийде!",
                            "Та попереду ще багато карток, тому не сумуй!",
                            "Але ніколи не здавайся!",
                            "Головне - пам'ятай про Оксанку!",
                            "Але це міг бути суддя Барса-Реал, тому старайся краще!"]
msg_success_guessed      = " відгадали!\n\nЦе | <code>|</code>!\nТайтл: <code>|</code>\n\nКартку додано до колекції |."
msg_button_label_inline  = "👀 Проглянути колекцію"
msg_error_wrong_name     = icon_error + ", неправильне ім'я/прізвище!"

# повідомлення у __main__ fav
msg_error_wrong_cmd      = icon_error + (", команда на встановлення улюбленої картки пишеться так: "
                                         "\n\n<code>/fav</code> <i>ID</i>")
msg_error_no_cards       = icon_error + ", у тебе взагалі немає карток! Відгадуй!"
msg_error_not_in_coll    = icon_error + ", картки з таким ID немає у твоїй колекції!"
msg_success_set_fav      = icon_success + ", картку \"|\" обрано як улюблену!"

# повідомлення у start
msg_bot_started_in_pm    = ("Привітики! Я - український бот для відловлювання колекцій карток персонажів із "
                            "різних аніме та ігор!\n\nДодаси мене до свого чату, і я надсилатиму випадкову картку "
                            "персонажа кожні 100 або більше повідомлень!\n\n"
                            "Цікаво? Тоді клацай на ДОДАТИ МЕНЕ ДО ЧАТУ, обирай свій чат і гайда збирати колекцію!")
msg_bot_started_in_chat  = ("Привіт усім! Я - Хапайка!\n\nЯ надсилаю картки різних персонажів із аніме та ігор, "
                            "а ви їх відгадуєте!\n\nУспіхів у відгадуванні!")
msg_bot_help_section     = ("Хочеш дізнатися, як мною користуватись?\n\nУсе просто! Я - бот, і маю всілякий "
                            "функціонал. Ось команди, які ти можеш мені віддавати!\n\n/guess - щоби відгадувати "
                            "персонажа\n/collection - оглянути колекцію своїх карток\n/fav - встановлювати улюблену "
                            "картку як головну у своїй колекції\n/trade - обмінюватися картками\n/gift - подарувати "
                            "комусь картку\n/ping - перевірити час відгуку\n\n/freq - змінити частоту випадань "
                            "карток у вашому чаті (ця команда доступна лише адмінам чату!)")

# повідомлення у broadcast
msg_error_non_auth_user  = icon_error + ", вам не дозволено використовувати цю команду."
msg_alert_not_reply      = icon_alert + (", використовуйте цю команду, відписуючи на повідомлення, "
                                         "яке бажаєте відправити.")
msg_info_broadcast       = icon_success + "Надсилання завершено.\n\nНе вдалося надіслати повідомлення | джерелам."

# повідомлення у frequency
msg_error_too_many_args  = icon_error + (", команда на зміну частоти випадання пишеться так:\n\n<code>/freq</code> "
                                         "<i>число</i>")
msg_error_frequency      = icon_error + ", вказана частота замала, мусить бути більше або дорівнювати "
msg_error_generic        = icon_error + ", не вдалося змінити частоту випадань через: "
msg_success_changed_freq = icon_success + "Успішно змінено частоту випадань карток до "

# повідомлення у collection
msg_info_no_cards        = icon_crying + ", у тебе ще немає жодної відгаданої картки!"

# повідомлення у inline_query
msg_info_general_card    = "Ого! Гляньте-но на |!\n\n<b>|</b>\n|. | [|]\n\n| загалом | разів."
msg_info_user_card       = "Ого! Гляньте-но на | у |!\n\n<b>|</b>\n|. | [|] x|"
msg_info_ai_report       = "⚠️ Доповісти про ШІ"